<a href="https://colab.research.google.com/github/tobias-fyi/DS-Unit-1-Sprint-2-Data-Wrangling-and-Storytelling/blob/master/module1-join-and-reshape-data/LS_DS_121_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

_Lambda School Data Science_

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
# I am editing this notebook in a local environment and already have the dataset
# !wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

In [0]:
# I am editing this notebook in a local environment and already have the dataset
# !tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

In [0]:
%cd instacart_2017_05_01

/Users/Tobias/workshop/dasci/sprints/02-Data_Wrangling_and_Storytelling/code/instacart_2017_05_01

In [0]:
!ls -lh *.csv

-rw-r--r--@ 1 Tobias  staff   2.5K May  2  2017 aisles.csv
-rw-r--r--@ 1 Tobias  staff   270B May  2  2017 departments.csv
-rw-r--r--@ 1 Tobias  staff   551M May  2  2017 order_products__prior.csv
-rw-r--r--@ 1 Tobias  staff    24M May  2  2017 order_products__train.csv
-rw-r--r--@ 1 Tobias  staff   104M May  2  2017 orders.csv
-rw-r--r--@ 1 Tobias  staff   2.1M May  2  2017 products.csv

In [0]:
import pandas as pd

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:
---

The columns I will need:

- Product name / id
- Product order quantity

In [0]:
# Go through the csv files to find those columns
# Starting with products
products = pd.read_csv("products.csv")
products.head()

,product_id,product_name,aisle_id,department_id
0,1,Chocolate Sandwich Cookies,61,19
1,2,All-Seasons Salt,104,13
2,3,Robust Golden Unsweetened Oolong Tea,94,7
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1
4,5,Green Chile Anytime Sauce,5,13

The `products.csv` file has the name of the product. I can join this to another dataset via the `product_id`.

In [0]:
# Next, I would assume that orders.csv has the product amount
orders = pd.read_csv("orders.csv")
orders.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

Looks like `orders.csv` does not have the quantity of product ordered.

In [0]:
# Reading in order_products__prior.csv to get quantity of each product on each order
order_products__prior = pd.read_csv("order_products__prior.csv")
print(order_products__prior.shape)
order_products__prior.head(16)

(32434489, 4)

    order_id  product_id  add_to_cart_order  reordered
0          2       33120                  1          1
1          2       28985                  2          1
2          2        9327                  3          0
3          2       45918                  4          1
4          2       30035                  5          0
5          2       17794                  6          1
6          2       40141                  7          1
7          2        1819                  8          1
8          2       43668                  9          0
9          3       33754                  1          1
10         3       24838                  2          1
11         3       17704                  3          1
12         3       21903                  4          1
13         3       17668                  5          1
14         3       46667                  6          1
15         3       17461                  7          1

I believe I can get the data I want by joining `products.csv` and `order_products__prior.csv` on the `product_id` column.

First, I need to concatenate `order_products__prior` and `order_products__train`.

In [0]:
# Load in order_products__train.csv
order_products__train = pd.read_csv("order_products__train.csv")
print(order_products__train.shape)
order_products__train.head()

(1384617, 4)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [0]:
# Concatenate the two order_products datasets
order_products = pd.concat([order_products__prior, order_products__train])
print(order_products.shape)
order_products.head()

(33819106, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [0]:
# Assertion to be sure the two add up
assert (order_products__prior.shape[0] + order_products__train.shape[0] == order_products.shape[0])

It does not look like the data shows how many of each product was purchased. It shows what product was added to which order, and the time of the order.

In [0]:
# Merge the products data with the order_products data
products_ordered_merged = pd.merge(order_products[["order_id", "product_id"]], products[["product_id", "product_name"]], how="inner", on="product_id")
print(products_ordered_merged.shape)
products_ordered_merged.head(16)

(33819106, 3)

    order_id  product_id        product_name
0          2       33120  Organic Egg Whites
1         26       33120  Organic Egg Whites
2        120       33120  Organic Egg Whites
3        327       33120  Organic Egg Whites
4        390       33120  Organic Egg Whites
5        537       33120  Organic Egg Whites
6        582       33120  Organic Egg Whites
7        608       33120  Organic Egg Whites
8        623       33120  Organic Egg Whites
9        689       33120  Organic Egg Whites
10       726       33120  Organic Egg Whites
11       771       33120  Organic Egg Whites
12       800       33120  Organic Egg Whites
13       901       33120  Organic Egg Whites
14      1005       33120  Organic Egg Whites
15      1097       33120  Organic Egg Whites

In [0]:
# Now I can use the .value_counts() chained with .nlargest(10) methods to get the top 10 ordered products
products_top10 = products_ordered_merged["product_name"].value_counts().nlargest(10)
products_top10

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

In [0]:
---

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

---

### Replicate the Lesson Code

In [0]:
%matplotlib inline
import pandas as pd
import numpy as np
import seaborn as sns

In [0]:
index = ["Captain Barbossa", "Jack Sparrow", "Will Turner"]
columns = ["islanda", "islandb"]

table1 = pd.DataFrame([[np.nan, 2],
                      [16, 11],
                      [3, 1]],
                     index=index,
                     columns=columns)

table2 = table1.T

In [0]:
table1

                  islanda  islandb
Captain Barbossa      NaN        2
Jack Sparrow         16.0       11
Will Turner           3.0        1

In [0]:
table2

         Captain Barbossa  Jack Sparrow  Will Turner
islanda               NaN          16.0          3.0
islandb               2.0          11.0          1.0

#### Tidying Up: Table1

In [0]:
# Make the index (currently the names) a column
table1 = table1.reset_index()
table1

              index  islanda  islandb
0  Captain Barbossa      NaN        2
1      Jack Sparrow     16.0       11
2       Will Turner      3.0        1

In [0]:
# Use pd.melt() to reshape the table into Tidy format
tidy_table1 = table1.melt(id_vars="index", value_vars=["islanda", "islandb"])
tidy_table1

              index variable  value
0  Captain Barbossa  islanda    NaN
1      Jack Sparrow  islanda   16.0
2       Will Turner  islanda    3.0
3  Captain Barbossa  islandb    2.0
4      Jack Sparrow  islandb   11.0
5       Will Turner  islandb    1.0

In [0]:
# Rename the columns into something useful
tidy_columns = {
    "index": "name",
    "variable": "island",
    "value": "days_marooned",
}

tidy_table1_named = tidy_table1.rename(columns=tidy_columns)

tidy_table1_named

               name   island  days_marooned
0  Captain Barbossa  islanda            NaN
1      Jack Sparrow  islanda           16.0
2       Will Turner  islanda            3.0
3  Captain Barbossa  islandb            2.0
4      Jack Sparrow  islandb           11.0
5       Will Turner  islandb            1.0

In [0]:
# Clean up "island" column to remove the extra text
tidy_table1_named["island"] = tidy_table1_named["island"].str.replace("island", "")
tidy_table1_named

               name island  days_marooned
0  Captain Barbossa      a            NaN
1      Jack Sparrow      a           16.0
2       Will Turner      a            3.0
3  Captain Barbossa      b            2.0
4      Jack Sparrow      b           11.0
5       Will Turner      b            1.0

---

#### Tidying Up: Table2

In [0]:
# Take a look at the table
table2

         Captain Barbossa  Jack Sparrow  Will Turner
islanda               NaN          16.0          3.0
islandb               2.0          11.0          1.0

In [0]:
# Make the index (currently the islands) a column
table2 = table2.reset_index()
table2

     index  Captain Barbossa  Jack Sparrow  Will Turner
0  islanda               NaN          16.0          3.0
1  islandb               2.0          11.0          1.0

In [0]:
# Use pd.melt() to reshape into a tidy table (I like being organized)
value_columns = [
    "Captain Barbossa",
    "Jack Sparrow",
    "Will Turner",
]

tidy_table2 = table2.melt(id_vars="index", value_vars=value_columns)

tidy_table2

     index          variable  value
0  islanda  Captain Barbossa    NaN
1  islandb  Captain Barbossa    2.0
2  islanda      Jack Sparrow   16.0
3  islandb      Jack Sparrow   11.0
4  islanda       Will Turner    3.0
5  islandb       Will Turner    1.0

In [0]:
# Rename the columns so they're a bit more informative
tidy2_columns = {
    "index": "island",
    "variable": "name",
    "value": "days_marooned",
}

tidy_table2_named = tidy_table2.rename(columns=tidy2_columns)

tidy_table2_named

    island              name  days_marooned
0  islanda  Captain Barbossa            NaN
1  islandb  Captain Barbossa            2.0
2  islanda      Jack Sparrow           16.0
3  islandb      Jack Sparrow           11.0
4  islanda       Will Turner            3.0
5  islandb       Will Turner            1.0

In [0]:
# Remove redundant "island" from the "island" column
# Now that it's named "island", no need for the "island" in each cell
tidy_table2_named["island"] = tidy_table2_named["island"].str.replace("island", "")
tidy_table2_named

  island              name  days_marooned
0      a  Captain Barbossa            NaN
1      b  Captain Barbossa            2.0
2      a      Jack Sparrow           16.0
3      b      Jack Sparrow           11.0
4      a       Will Turner            3.0
5      b       Will Turner            1.0

---

#### De-Tidying: Table1

In [0]:
wide_table1 = tidy_table1_named.pivot_table(index="name", columns="island", values="days_marooned")
wide_table1

island               a     b
name
Captain Barbossa   NaN   2.0
Jack Sparrow      16.0  11.0
Will Turner        3.0   1.0

---

#### De-Tidying: Table2

In [0]:
wide_table2 = tidy_table2_named.pivot_table(index="island", columns="name", values="days_marooned")
wide_table2

name    Captain Barbossa  Jack Sparrow  Will Turner
island
a                    NaN          16.0          3.0
b                    2.0          11.0          1.0

---

- Load seaborn's `flights` dataset by running the cell below.
- Then create a pivot table showing the number of passengers by month and year.
    - Use year for the index and month for the columns. 
    - You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
# Load the seaborn "flights" dataset
flights = sns.load_dataset('flights')

In [0]:
# Check out the data
print(flights.shape)
flights.head(8)

(144, 3)

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121
5  1949      June         135
6  1949      July         148
7  1949    August         148

In [0]:
# Create pivot table with year as index and month as column
flights_table = flights.pivot_table(index="year", columns="month", values="passengers")
flights_table

month,January,February,March,April,May,June,July,August,September,October,November,December
year,,,,,,,,,,,,
1949,112,118,132,129,121,135,148,148,136,119,104,118
1950,115,126,141,135,125,149,170,170,158,133,114,140
1951,145,150,178,163,172,178,199,199,184,162,146,166
1952,171,180,193,181,183,218,230,242,209,191,172,194
1953,196,196,236,235,229,243,264,272,237,211,180,201
1954,204,188,235,227,234,264,302,293,259,229,203,229
1955,242,233,267,269,270,315,364,347,312,274,237,278
1956,284,277,317,313,318,374,413,405,355,306,271,306
1957,315,301,356,348,355,422,465,467,404,347,305,336
1958,340,318,362,348,363,435,491,505,404,359,310,337
1959,360,342,406,396,420,472,548,559,463,407,362,405
1960,417,391,419,461,472,535,622,606,508,461,390,432

Can confirm:

- Jan 1949 has 112 passengers
- Dec 1960 has 432 passengers

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

---

#### Latest Ordered Popular Products

In order to get the most popular products in the latest part of the day, I'll need to make some sort of table that sorts the .value_count() of orders by time of day.

In [0]:
# take a look at the orders dataset
print(orders.shape)
orders.head()
# I'll need from this dataset:
# order_id, order_hour_of_day

(3421083, 7)

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

In [0]:
# And at the order_products concatenated dataset from earlier
print(order_products.shape)
order_products.head()
# I'll need this dataset to connect the products and orders datasets. Thus, I'll need:
# order_id, product_id

(33819106, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [0]:
# Now looking at the products dataset
print(products.shape)
products.head()
# From this dataset, I'll need:
# product_id, product_name

(49688, 4)

,product_id,product_name,aisle_id,department_id
0,1,Chocolate Sandwich Cookies,61,19
1,2,All-Seasons Salt,104,13
2,3,Robust Golden Unsweetened Oolong Tea,94,7
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1
4,5,Green Chile Anytime Sauce,5,13

Columns needed:

- products
    - product_id
    - product_name (for display purposes)
- order_products
    - order_id
    - product_id
- orders
    - order_id
    - order_hour_of_day

In [0]:
# Now to join the three datasets
orders_products_orderproducts_merged = (orders[["order_id", "order_hour_of_day"]]
                                       .merge(order_products[["order_id", "product_id"]])
                                       .merge(products[["product_id", "product_name"]]))

orders_products_orderproducts_merged

,order_id,order_hour_of_day,product_id,product_name
0,2539329,8,196,Soda
1,2398795,7,196,Soda
2,473747,12,196,Soda
3,2254736,7,196,Soda
4,431534,15,196,Soda
5,3367565,7,196,Soda
6,550135,9,196,Soda
7,3108588,14,196,Soda
8,2295261,16,196,Soda
9,2550362,8,196,Soda
10,1187899,8,196,Soda
11,2968173,9,196,Soda
12,1870022,16,196,Soda
13,1911383,11,196,Soda
14,2715276,9,196,Soda
15,487368,10,196,Soda
16,2293453,14,196,Soda
17,1973799,12,196,Soda
18,532817,17,196,Soda
19,1573906,10,196,Soda
...,...,...,...,...
33819086,461844,11,15408,Training Fluoride Free Toothpaste Apple & Ban...
33819087,216145,14,15408,Training Fluoride Free Toothpaste Apple & Ban...
33819088,2941852,15,8682,All Purpose Eraser
33819089,2321285,10,8682,All Purpose Eraser
33819090,609055,13,43553,Orange Energy Shots
33819091,1928449,9,43553,Orange Energy Shots
33819092,2222639,9,43553,Orange Energy Shots
33819093,339942,10,43553,Orange Energy Shots
33819094,2798193,13,43553,Orange Energy Shots
33819095,2391791,6,43553,Orange Energy Shots
33819096,576295,10,43553,Orange Energy Shots
33819097,960088,12,43553,Orange Energy Shots
33819098,343962,10,43553,Orange Energy Shots
33819099,2329472,12,43553,Orange Energy Shots
33819100,694731,14,43553,Orange Energy Shots
33819101,1320836,15,43553,Orange Energy Shots
33819102,31526,11,43553,Orange Energy Shots
33819103,758936,7,42338,"Zucchini Chips, Pesto"
33819104,2745165,5,42338,"Zucchini Chips, Pesto"
33819105,3093936,14,28818,Hot Oatmeal Multigrain Raisin

In [0]:
# Filter the dataset based on popular: > 2700 orders
# First, get a list of the popular products
product_counts = orders_products_orderproducts_merged["product_name"].value_counts()

In [0]:
# take a look to see
product_counts

Banana                            491291
Bag of Organic Bananas            394930
Organic Strawberries              275577
Organic Baby Spinach              251705
Organic Hass Avocado              220877
                                   ...
Sloppy Joe Sandwich Makers             1
Bottle & Nipple Brush Set              1
Salsa, Black Bean                      1
Coconut Cardamom Almond Butter         1
Piquillo & Jalapeno Bruschetta         1
Name: product_name, Length: 49685, dtype: int64

In [0]:
print(type(product_counts))

<class 'pandas.core.series.Series'>

In [0]:
# Keep only the products with more than 2700 orders
popular_products_count = product_counts[product_counts > 2700]
popular_products_count

Banana                                  491291
Bag of Organic Bananas                  394930
Organic Strawberries                    275577
Organic Baby Spinach                    251705
Organic Hass Avocado                    220877
                                         ...
Meyer Lemons                              2712
Organic Popcorn                           2706
Yogurt Tubes Blueberry                    2705
Organic Go Go Apple Peach Applesauce      2705
Snacks Mango                              2705
Name: product_name, Length: 2210, dtype: int64

In [0]:
print(popular_products_count.shape)  # That reduces the number of products by a lot!

(2210,)

In [0]:
# Now I'll need to get a list of those products, and use it to filter the main dataset
pop_products_list = popular_products_count.tolist()
print(len(pop_products_list))

2210

In [0]:
# Got the list; time to filter based on it
popular_products_filtered = orders_products_orderproducts_merged["product_name"].isin(pop_products_list)
print(popular_products_filtered.shape)
popular_products_filtered.head(16)

(33819106,)

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
Name: product_name, dtype: bool

In [0]:
# Now I'll need to count how many of each product is ordered and sort the result by hour of the day

In [0]:
# TODO: re-run this once the dataset is filtered to only popular products
ct_hour_count = pd.crosstab(orders_products_orderproducts_merged["order_hour_of_day"], orders_products_orderproducts_merged["product_name"])
ct_hour_count

product_name,#2 Coffee Filters,#2 Cone White Coffee Filters,#2 Mechanical Pencils,#4 Natural Brown Coffee Filters,& Go! Hazelnut Spread + Pretzel Sticks,'Swingtop' Premium Lager,(70% Juice!) Mountain Raspberry Juice Squeeze,+Energy Black Cherry Vegetable & Fruit Juice,".5\"" Waterproof Tape",0 Calorie Acai Raspberry Water Beverage,...,with Twist Ties Sandwich & Storage Bags,with Xylitol Cinnamon 18 Sticks Sugar Free Gum,with Xylitol Island Berry Lime 18 Sticks Sugar Free Gum,with Xylitol Minty Sweet Twist 18 Sticks Sugar Free Gum,with Xylitol Original Flavor 18 Sticks Sugar Free Gum,with Xylitol Unwrapped Original Flavor 50 Sticks Sugar Free Gum,with Xylitol Unwrapped Spearmint 50 Sticks Sugar Free Gum,with Xylitol Watermelon Twist 18 Sticks Sugar Free Gum,with a Splash of Mango Coconut Water,with a Splash of Pineapple Coconut Water
order_hour_of_day,,,,,,,,,,,,,,,,,,,,,
0,3,0,0,3,0,0,1,0,1,1,...,0,0,0,0,2,0,0,0,0,0
1,4,0,0,0,0,0,0,0,1,0,...,0,1,0,0,1,0,0,0,0,0
2,4,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
3,1,0,1,0,0,0,0,0,0,0,...,0,1,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,0,0,0,0,...,0,1,0,0,0,0,0,0,0,0
5,1,0,0,0,0,0,0,0,0,1,...,0,0,0,0,0,0,0,0,0,0
6,6,0,0,0,4,0,2,0,0,1,...,0,0,0,0,2,0,0,0,0,0
7,28,1,0,8,4,0,2,2,0,2,...,0,11,2,1,3,3,1,2,0,0
8,42,1,0,19,11,0,3,1,0,4,...,1,18,4,1,3,4,1,4,3,4
9,59,4,1,26,19,0,1,5,2,8,...,1,14,9,2,29,2,3,8,2,1
10,65,2,3,26,16,0,3,2,1,12,...,1,38,6,2,10,3,6,5,2,7
11,71,0,0,35,10,0,3,3,1,4,...,0,14,1,4,22,5,3,9,4,5
12,62,0,1,21,17,0,2,4,1,7,...,3,16,11,2,15,2,3,6,4,7
13,69,0,0,16,13,0,2,1,0,7,...,5,13,2,3,14,3,7,3,0,6
14,64,2,0,19,12,0,2,1,1,6,...,5,11,3,3,21,4,6,7,2,7
15,75,1,0,14,12,0,3,3,0,7,...,1,9,2,2,17,2,9,5,3,5
16,65,1,2,18,12,0,3,1,0,7,...,1,12,2,3,12,3,3,6,2,5
17,55,0,0,9,22,0,0,0,0,7,...,0,7,2,1,15,2,4,5,3,4
18,34,1,0,8,5,0,0,2,0,9,...,1,8,1,0,9,1,5,2,0,3
19,29,0,0,8,6,1,0,4,0,6,...,2,3,1,0,11,4,2,3,1,1
20,26,1,0,8,3,0,0,1,0,5,...,0,5,3,2,2,1,2,4,1,1
21,19,0,0,5,6,0,0,0,0,3,...,0,8,1,1,2,0,1,1,0,1
22,9,0,1,3,2,0,0,0,0,1,...,0,3,0,0,2,0,1,1,0,0
23,8,0,0,1,0,0,1,0,0,1,...,1,7,0,0,0,2,0,2,0,0

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####